{
  "english": {
    "aboutme": "During my time practicing my career as an Accountant, I learned a lot about teamwork due to my experience in the tax sector when I worked for one of the 4 Big Four, Pwc (PriceWaterhouseCoopers). I lived for a time in Barcelona where I came into contact with the tech environment where I was surprised by the power of creativity and freedom that this offered, giving a strong turn to my life I decided to study development web in the bootcamp of 'Plataforma 5'. As I progressed through the program, my passion for the field of information technology grew exponentially, becoming much more exciting and rewarding than my previous job. I have been looking for something that I truly feel passionate about and that aligns with my true self for a long time, and now that I have found it, I am not going to stop.",
    "aboutme2": "- I worked 4 years in the area of Accounting: 2 years at PriceWaterHouseCoopers and 2 years at an Argentinian SME.(2017-2021)",
    "aboutme3": "- I was a programming professor at Plataforma5: I was responsible for teaching theoretical classes on Back in Nodejs and Front in ReactJs. I also mentored their projects and provided feedback. It was a course from Monday to Friday, 9 am to 7 pm.(2023)",
    "aboutme4": "- I developed a website for the company Clarín (back and front). I used Next.js and Firebase for the project. It is a static news page. It was my first freelance project for the company iteseHub.(2023)",
    "viewWork": "ViewWork",
    "about": "About",
    "skills": "Skills",
    "work": "Work",
    "contact": "Contact",
    "hola": "Hello. How are they?",
    "read": "Read",
    "read1": "If you click on Code, it takes you to GitHub, and if you click on the title, it takes you to the project description (with all its photos).",
    "read2": "If you click on Video, it redirects you to a site where I explain the project.",
    "submit": "Send",
    "ehome": "This is the main home of the page where we see a carousel where the photos of our popular products are passing, as well as below we can see these same products.",
    "eproductos": "Here we can see these products where they are divided by category that clicking on any of them takes you to those products. One can see the photo of the product, with its price and its description. Clicking on the product takes you to another route with its full details and the option to add it to the cart.",
    "edetalle": "Here we can see the detail of the product and the option to add it to the cart.",
    "ecarrito": "Here is the cart where the user decides whether to buy or not. The user can modify the quantities from the cart without the need to go back to add them. The garbage can eliminates the product with all its amounts. And there are two options to make the payment. Once the order is made, the cart is deleted so that if the user wants to buy the next day, he does not see these products in the cart",
    "epedidos": "Here we can see the history of products made by the user, none of this data is hardcoded, the order id takes into account the last order and one is added to make it correct. And all that data, such as the date, is taken from the database where the table with those records is.",
    "ecalificaciones": "Here the user can rate the products that were not rated. That score is then added to the average score for that product. A comment is also added to record the user's opinions.",
    "eadmin": "The admin can add, edit and delete products, as can be seen here by tapping on the + next to Meat. It is only enabled when the administrator logs in. It is not here in the photo, but the administrator can make the users administrator and in turn remove the administration.",
    "mhome": "This is the home screen, where we see a Carousel with the best movies that go by automatically. We have a browser, where it takes us to the Page Registration, to the favorites, to the registered users and to the Home. We also have two inputs, one for movies and the other for series where when placing a name the poster pulls us down with all its movies or series.",
    "mdetalle": "Here we can see the detail of a movie that I want to select with its score, its title, and a detail. In addition, we also have a viewMore button where clicking opens a text with the review of the film that was taken through the Puppeteer library with Web Scraping.",
    "mfavoritos": "Here we can see the favorite movies of each user, where one can remove them without refreshing the page. In addition, clicking on the name takes you to the details of the movie.",
    "mregistro": "Here the user can log in to the page with their email and password. Simple, it was one of my first projects and touching register takes you to another route where we can create a user."
  },

  "spanish": {
    "aboutme": "Durante mi tiempo ejerciendo mi carrera como Contador, aprendí mucho del trabajo en equipo debido a mi experiencia en el sector impositivo cuando trabajé para una de las 4 Big Four, Pwc (PriceWaterhouseCoopers). Viví un tiempo en Barcelona donde entré en contacto con el ambiente tech en el que me sorprendió el poder de creatividad y libertad que esto brindaba, dándole un fuerte giro a mi vida decidí estudiar desarrollo web en el bootcamp de 'Plataforma 5'. A medida que avanzaba en el programa, mi pasión por el mundo de las tecnologías de la información crecía exponencialmente, resultando mucho más emocionante y gratificante que mi trabajo anterior. Hace mucho que buscaba algo que me guste y que sea acorde a quien soy, y ahora que lo he encontrado, no voy a parar.",
    "aboutme2": "- Trabajé 4 años en el área de Contabilidad: 2 años en PriceWaterHouseCoopers y 2 años en una Pyme Argentina.(2017-2021)",
    "aboutme3": "- Fui profesor de programación en Plataforma5: Era el encargado de dar las clases teóricas de Back en Nodejs y Front en ReactJs. También mentoré sus proyectos y los corregí. Fue un curso de lunes a viernes de 9 am a 7 pm.(2023)",
    "aboutme4": "- Desarrollé una página para la empresa Clarín (back y front). Usé Next.js y Firebase para el proyecto. Es una página estática de noticias. Fue mi primer proyecto freelance para la empresa iteseHub.(2023)",
    "viewWork": "Mira los trabajos",
    "about": "Acerca",
    "skills": "Herramientas",
    "read": "Leer",
    "read1": "Si haces click en Code, te lleva a github y si haces click en el título te lleva a la descripción del proyecto(con toda sus fotos",
    "read2": "Si haces click en video, te redirige a un sitio donde explico el proyecto",
    "work": "Trabajo",
    "contact": "Contacto",
    "hola": "Hola, ¿Cómo estan?",
    "submit": "Enviar",
    "ehome": "Este el home principal de la página donde vemos un carrusel donde van pasando las fotos de nuestros productos populares, como también más abajo podemos ver estos mismos productos.",
    "eproductos": "Acá podemos ver estos productos donde están divididos por categoría que al cliquear cualquier de ellas te lleva a esos productos. Uno puede ver la foto del producto, con su precio y su descripción. Al cliquear el producto te lleva a otra ruta con su detalle completo y la opción de agregarla al carrito.",
    "edetalle": "Acá podemos ver el detalle del producto y la opción de agregarla al carrito.",
    "ecarrito": "Acá se encuentra el carrito donde el usuario decide si comprar o no.El usuario puede modificar las cantidades desde el carrito sin la necesidad de volver atrás para agregarlos. EL tacho de basura elimina el producto con todas sus cantidades.Y se encuentra las dos opciones para realizar el pago. Una vez hecho el pedido el carrito se borra para que si el usuario al día siguiente quiere comprar no ve estos productos en el carrito",
    "epedidos": "Here we can see the history of products made by the user, none of this data is hardcoded, the order id takes into account the last order and one is added to make it correct. And all that data, such as the date, is taken from the database where the table with those records is.",
    "ecalificaciones": "Acá el usuario puede calificar los productos que no fueron calificados. Luego ese puntaje se le suma al promedio del puntaje de ese producto. También se le agrega un comentario para que quede registrado las opiniones del usuario.",
    "eadmin": "El administrador puede agregar, editar y borrar productos, como se puede ver acá al tocar el + que esta al lado de Carne. Sólo se habilita cuando el administador se loguea. No esta acá en la foto, pero el administrador puede hacer administrador a los usuarios y a su vez sacarle la administración.",
    "mhome": "Esta es la pantalla de inicio, donde vemos un Carrusel con las mejores películas que van pasando automáticamente. Tenemos un navegador, donde nos lleva al Registro de la página, a los favoritos, a los usuarios registrados y al Home. También tenemos dos inputs, una para películas y otra para series que al colocar un nombre nos tira el cartel abajo con todas sus películas o series",
    "mdetalle": "Acá podemos ver el detalle de una película que quiero seleccionar con su puntuación, su título, y un detalle. Además también tenemos un botón viewMore donde al cliquear se abre un texto con la crítica de la película que fue sacado a través de la librería Puppeteer con Web Scraping",
    "mfavoritos": "Acá podemos ver las películas favoritas de cada usuario, donde uno puede removerlas sin actualizar la página. Además al hacer clic en el nombre te lleva al detalle de la película.",
    "mregistro": "Acá el usuario puede loguiar a la página con su email y lacontraseña. Simple, fue uno de mis primeros proyectos y al tocar registrarse te lleva a otra ruta dónde podemos crear un usuario."
  }
}
